sso/temp.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><AddUser xmlns="https://services.up-ltd.co.uk/adminservice_iwidget/"><name>test_user</name><password>f5ca5ea22eccf1f099f55aa4af44026d652a175d1a59b682af2ce64852b855ebe40450a4dc90a106686d88682c63df46dc05f74152ca398ec4b3e2e77923075d</password><serviceUsername>IWidgetService</serviceUsername><servicePassword>%%ADMINPASSWORD%%</servicePassword></AddUser></soap:Body></soap:Envelope>